# file สำหรับเขียนคำตอบ
# ในกรณีที่มีการสร้าง function อื่น ๆ ให้ระบุว่า input-output คืออะไรด้วย
'''
ชื่อ_รหัส(ธนวัฒน์_6461)
1.ธฤต_ุ6530
2.พรวลัย_6542
'''
#===============================================<IMPORT>========================================================#
from HW3_utils import FKHW3
import numpy as np
#==============================================================================================================#
#=============================================<คำตอบข้อ 1>======================================================#
def endEffectorJacobianHW3(q:list[float])->list[float]:
    R, P, R0_e, P0_e = FKHW3(q)
    Jv_T = np.empty((3,3),dtype=np.float32)
    Jw_T = np.empty((3,3),dtype=np.float32)

    # หา Jref0
    for i in range(len(q)):
        Jv_T[i] = np.cross(np.transpose(R[:,:,i] @ [[0],[0],[1]]), P0_e - P[:,i])[0] #Jv = zi x (P0_e - P0_i), zi = R0_i * [[0], [0], [1]] -> 3*1 transpose = 1*3
        Jw_T[i] = np.transpose(R[:,:,i] @ [[0],[0],[1]])

    #แปลง Jref0 เป็น Jrefv
    Jv_T = Jv_T @ R0_e # จาก Jref0T * R0_e *ve = JrefeT * ve จะได้ว่า JrefeT = Jref0T * R0_e
    Jw_T = Jw_T @ R0_e
    Jv = np.transpose(Jv_T)
    Jw = np.transpose(Jw_T)
    J = np.vstack((Jv, Jw))
    return J
#==============================================================================================================#
#=============================================<คำตอบข้อ 2>======================================================#
def checkSingularityHW3(q:list[float])->bool:
    return abs(np.linalg.det(endEffectorJacobianHW3(q)[:3])) < 0.001 #J_reducd = Jv = 3 แถวด้านบน
#==============================================================================================================#
#=============================================<คำตอบข้อ 3>======================================================#
def computeEffortHW3(q:list[float], w:list[float])->list[float]:
    w = [w[3], w[4], w[5], w[0], w[1], w[2]] #เปลี่ยนจาก [moment, force] เป็น [force, moment]
    return endEffectorJacobianHW3(q).T @ w #tau = J(e) * w(e)
#==============================================================================================================#